[
  {
    "title": "Лампочки",
    "condition": "В закрытой комнате на чердаке висят три лампочки. Три выключателя к трём лампочкам – внизу, на первом этаже. Можно щёлкать выключателями сколько угодно, и можно оставить их в любом положении. Но после этого разрешён только один поход наверх, чтобы определить, каким из выключателей включается каждая лампочка.",
    "solution": "Включите одну из лампочек и оставьте её включенной на несколько минут... ну, чтобы она нагрелась. И после этого всё, что останется сделать – это выключить её, включить другую лампочку, залезть на чердак, потрогать лампочки и определить, какая из них была включена первой (та, что ещё теплая).\nТеперь нетрудно будет догадаться, какую вы включили второй, а какую еще не включали :-)",
    "image": "assets/images/lamp.jpg"
  },
  {
    "title": "Мячик в трубе",
    "condition": "Ваш последний мячик для настольного тенниса закатился в трубу, вертикально заделанную в цементный пол на 30 см в глубину. Труба лишь чуть шире, чем мячик. В вашем распоряжении имеются только ракетка для настольного тенниса, шнурки от ботинок и пластиковая бутылка с питьевой водой (бутылка шире отверстия в трубе).\nКак достать теннисный шарик, не повредив его?",
    "solution": "Все предложенные подручные средства Вам не помогут. Всё, что от Вас требуется – это вылить воду из бутылки в трубу, чтобы теннисный мячик всплыл на поверхность. Отговорки вроде «у меня недостаточно воды» не пройдут.\nВспомните, что Вы пили за весь день, и можно ли это как-нибудь применить с пользой для дела :-)"
  },
  {
    "title": "Поездки в лифте",
    "condition": "Каждое утро один человек спускается на лифте с десятого этажа, где находится его квартира, и идёт на работу. Когда он возвращается с работы в дождливые дни, или если в лифте с ним находятся другие люди, он едет на свой 10-й этаж. Во всех остальных случаях он поднимается на лифте только до 7-го этажа и оставшийся путь идёт по лестнице пешком.\nПожалуй, это одна из самых популярных и любимых загадок, требующих нестандартного мышления – настоящая классика. Существует множество возможных объяснений странному поведению человека в лифте. Однако только один ответ по-настоящему удовлетворителен.",
    "solution": "Этот человек невысокого роста. Он не может достать до верхних кнопок в лифте, но может попросить кого-нибудь из находящихся с ним в кабине людей нажать нужную кнопку. Или достать до неё с помощью зонта."
  },
  {
    "title": "Бросание мяча",
    "condition": "Вы бросили мяч, и он прилетел к Вам назад, ни обо что не ударившись на своём пути и не попав к кому-либо в руки.\nКак вам это удалось?",
    "solution": "Подбросьте мяч вертикально вверх."
  },
  {
    "title": "Магнит",
    "condition": "Эта задачка позаимствована из рубрики занимательных задач, опубликованных Мартином Гарднером в журнале \"Сайнтифик американ\" (“Scientific American”).\nВ комнате нет никаких железных предметов, кроме двух металлических стержней, один из которых – магнит.\nКак определить, который из стержней - магнит?",
    "solution": "Подвесьте железные стержни на веревочке и посмотрите, который из них развернется и сориентируется на север (ну или подвесьте стержни по отдельности). Гарднет предлагает ещё один вариант решения: возьмите один из стержней и дотроньтесь его концом до середины второго стержня. Если они притягиваются, то у Вас в руке магнит. У настоящего магнита полюса будут расположены на концах, а не посередине. Именно поэтому если взять железный стержень и дотронуться его концом до середины магнита, они притягиваться не будут. Этот вариант работает при условии, что полюса магнита расположены на его концах. Если же полюса магнита расположены по всей его длине, данный способ решения несколько затруднителен тем, что в таком случае один железный стержень следует вращать вокруг своей оси и в то же время удерживать один из концов второго стержня у середины первого. Если вращающийся стержень – магнит, сила притяжения будет меняться по мере его вращения. Если же вращающийся стержень не является магнитом, сила притяжения постоянна (если, конечно, Вы сумеете аккуратно удерживать их в постоянном положении относительно друг друга)."
  },
  {
    "title": "Осада замка",
    "condition": "На квадратном острове стоит квадратный замок, окружённый по всему квадратному периметру глубоким рвом шириной в десять метров. Из-за досадного просчёта, в распоряжении у армии, пришедшей штурмовать замок, имеются перекидные мосты длиной всего лишь девять с половиной метров каждый.\nКак же решить проблему перехода через ров?",
    "solution": "Можно положить один перекидной мост на угол рва (таким образом, образуется треугольник). Затем с середины данного моста перебросить другой перекидной мост к углу замка. Парочка простых уравнений поможет Вам убедиться, что этого будет достаточно."
  },
  {
    "title": "Микробы",
    "condition": "В пробирку посадили микроб ровно в 12 часов дня. Каждую минуту микроб делится на два таких же микроба, те, в свою очередь, через минуту тоже делятся, и т.д..\nВ 12:43 после полудня пробирка была наполовину заполнена. Когда пробирка будет заполнена целиком?",
    "solution": "Поверхность чашки Петри будет полностью покрыта бактериями в 12:44."
  },
  {
    "title": "Наследство шаха",
    "condition": "Шейх приказал своим двум сыновьям оседлать верблюдов и гнать на них через пустыню в один удалённый город. Чей верблюд прийдёт к финишу последним, тот и будет приемником шейха и получит всё его наследство. Два дня сыновья бродили по городу, не зная, что делать. Наконец, они обратились к мудрецу, который дал им совет. После этого молодые люди вскочили на верблюдов и изо всех сил погнали через пустыню.\nЧто посоветовал мудрец?",
    "solution": "Мудрец сказал: «Поменяйтесь верблюдами!»"
  },
  {
    "title": "Философ и часы",
    "condition": "А вот старинная логическая задачка.\nОдин рассеянный древний философ забыл завести единственные в его доме часы. Когда часы остановились, философу не от куда было узнать время. У него не было ни радио, ни телевизора, ни телефона, ни интернета... Тогда философ отправился пешком к другу, который жил всего в нескольких километрах от него. Там он и заночевал. А на следующий день философ вернулся домой и установил на часах правильное время.\nКаким образом он определил время?",
    "solution": "Философ мог перед выходом из дома завести свои часы и поставить произвольное время. Таким образом, зная время своего отсутствия по домашним часам, а также время прибывания у друга по его часам, философ мог вычислить время потраченное на дорогу, а после этого и правильное время прибытия домой."
  },
  {
    "title": "Магистры логических наук",
    "condition": "Три магистра заспорили, кто из них умнее. Чтобы разрешить спор, пришлось позвать главного магистра, который предложил следующий тест: «Пусть все завяжут глаза, а я нарисую каждому на лбу либо красную, либо синюю точку. Когда я сниму ваши повязки с глаз, каждый, кто видит хоть одну красную точку, должен поднять руку. После этого вы должны угадать, какого цвета точка у вас на лбу. Кто первый угадает – тот и умнее!»\nМагистры послушно завязали глаза, и главный магистр нарисовал каждому на лбу пятно красной кисточкой. Сняв повязку, все три конкурента подняли руку, как им и было предписанно. После этого они задумались. Наконец один сказал: «У меня на лбу красная точка.»\nКак он угадал?",
    "solution": "Выигравший магистр, должно быть, рассуждал следующим образом: руки подняли все трое из нас, и я вижу две красные точки, таким образом на мне либо синяя, либо красная точка. Если бы на мне была синяя точка, то два других магистра видели бы одну красную и одну синюю точку. Тогда если какой-либо из них видит мою синюю точку, и каждый из них поднимает руку, то они видят красные пятна на друг друге, но они продолжают молчать и руки не поднимают (а им, не забываем, ума не занимать), а это значит, что предположение о синем пятне на моем лбу неверно – у меня краное пятно. Иными словами, каждый из нас (назовем нас буквами A, B, C(С-это я)) поднял руку, что означает, что каждый из нас видит хотя бы одно красное пятно на лбу другого.\nЕсли у С на лбу синее пятно, то А и В видят, во-первых, что у всех руки подняты, во-вторых, видят одно красное пятно (иначе бы они руку не поднимали), и в-третьих, видят одно синее пятно (на лбу у С, то есть у меня). Следовательно, А и В будут оба рассуждать следующим образом: если у двух других магистров руки подняты, а я вижу одну красную и одну синюю точку, тогда магистр с красной точкой на лбу поднял руку, потому что он где-то видит красную точку, а это может только означать, что он видит красную точку на мне, то есть у меня на лбу красная точка. Но ни А, ни В ничего не говорят, а значит они не уверены так, как если бы они были уверены в правильности своих предположений, если бы они увидели на моем лбу синюю точку. Если они не видят на моем лбу синюю точку, значит они должны видеть там красную точку.\nСледовательно, у меня на лбу красная точка."
  },
  {
    "title": "Магистры логических наук II (Колпаки)",
    "condition": "Два магистра, проигравшие соревнование с пятнами на лбу, пожаловались, что победитель замешкался с поднятием руки и, таким образом, сбил их с толку. Уязвлённый главный магистр пообещал придумать такое новое испытание, чтобы никто не мог пожаловаться на неравные шансы. Он показал троим конкурентам 5 колпаков – 2 белых и 3 чёрных. После этого он выключил в комнате свет, надел на голову каждому магистру по колпаку и спрятал два оставшихся. Однако прежде, чем он успел включить свет, один из конкурентов закричал: «Я знаю, какой на мне колпак!» И назвал свой колпак правильно. Так получилось, что это оказался тот же магистр, который выиграл и первый турнир.\nКак он угадал?",
    "solution": "Важным моментом в этой задачке является тот факт, что у всех магистров были одинаковые шансы на выигрыш. Если бы одному из них одели черный колпак, а двум другим по белому колпаку, то магистр в черном колпаке моментально догадался бы о том, какого цвета на нем колпак (в то время как другие два магистра еще бы долго ломали голову). Поэтому один черный и два белых колпака не дают магистрам равных шансов.\nЕсли же задействовать два черных и один белый колпак, то у магистров в черных колпаках будет преимущество. Увидев один черный и один белый колпак на головах двух сидящих напротив магистров и предположив, что на нём самом сейчас белый колпак, магистр будет ожидать моментальной реакции от того, кто в черном колпаке, следуя логике предыдущей задачки.\nНо если оба магистра в черных колпаках молчат – значит они, каждый сам по себе, постепенно догадаются, что на них черный колпак. В то время как магистр в белом колпаке будет обречен на вечные раздумья, видя перед собой обоих магистров в черных колпаках. Поэтому такой расклад также не дает магистрам равных шансов.\nПолучается, что единственный способ предоставить всем трём равные шансы – это одеть на них одинаковые черные колпаки. Надеюсь, это понятно."
  },
  {
    "title": "Магистры логических наук III (Разноцветные марки)",
    "condition": "Эта головоломка немного сложнее.\nГлавный магистр показал 3-м своим ученикам A, B и С 8 разноцветных марок – 4 зелёных и 4 красных. После этого он наклеил каждому на лоб по две так, чтобы ученик знал, какие марки у других, но не свои. Оставшиеся 2 марки главный магистр спрятал в карман, и никто не видел, какие именно марки он спрятал. После этого главный магистр задавал A, B и С по очереди один и тот же вопрос: «Знаешь ли ты цвет своих марок?» И он получил следующие ответы:\nА: «Нет»\nВ: «Нет»\nС: «Нет»\nА: «Нет»\nВ: «Да»\nКакого цвета были марки у В и у двух других магистров?",
    "solution": "Магистр В рассуждал следующим образом: «Допустим, у меня красная-красная. Тогда на втором круге магистр А подумал бы: «Я вижу на магистре В красную-красную. Если у меня тоже красная-красная, то все красные марки бы на этом закончились, и магистр С сразу бы понял, что на нем зелёная-зелёная. Но магистр С ничего не сказал, а значит у меня не красная-красная. Положим, у меня зелёная-зелёная. В таком случае магистр С сразу бы понял, что если на нем красная-красная, то я бы увидел четыре красных и сразу бы ответил еще на первом круге, что на мне зелёная-зелёная. С другой стороны, если на магистре С тоже зелёная-зелёная [Предполагается, что магистры А и С могут видеть друг друга. Ну так, на всякий случай напомню...], тогда магистр В увидел бы четыре зеленых и на первом же круге сразу бы ответил, что на нём красная-красная. Следовательно, магистр С понял бы, что если на мне (магистре А) зелёная-зелёная, а на магистре В красная-красная, и ни магистр А, ни магистр В не смогли ответить на вопрос на первом круге, то на магистре С зелёная-красная. Но магистр С к такому выводу не пришел, поэтому вариант зелёная-зелёная на моём лбу отпадает.\nА если у меня не может быть ни красная-красная, ни зелёная-зелёная, значит у меня остается только вариант зелёная-красная.»» Магистр В продолжил свои рассуждения: «Но магистр А не ответил, что у него на лбу красная-зелёная, так что моё предположение о том, что у меня на лбу красная-красная, неверно. На этом же основании я могу сделать вывод о том, что на мне не зелёная-зелёная. Тогда остается только одно – на мне красная-зелёная.» Таким образом, на магистре В были красная и зелёная марки. О том, какие марки были у других магистров, мы точно сказать не можем.\n(На самом деле при решении этой задачки можно пойти с конца и догадаться,что у того магистра, который ответил, что знает, какие на нём марки, должно было созреть такое решение, которое сработает, если сочетание марок будет смешанным, то есть красная-зелёная.)"
  },
  {
    "title": "Индейский тест",
    "condition": "Воинствующее индейское племя взяло в плен трёх бледнолицых. По старинному обычаю, пленным был предложен тест. Вождь показал им 5 головных повязок – 3 белых и 2 красных. Пленным завязали глаза, надели на головы повязки, выстроили их друг за другом, затылок в затылок, и развязали глаза. Поледний в строю видит повязки на двух стоящих впереди него товарищах, второй – повязку первого, а первый не видит никого. По правилам, пленникам даётся только одна попытка угадать цвет своей повязки. Эту догадку может озвучить любой из них, и, если он угадает цвет своей повязки, то всех троих отпустят на свободу. К счастью, все трое оказались студентами академии логических наук, и им не составило труда с достоинством выдержать этот тест. Через несколько минут тишины стоящий спереди сказал: \"Я знаю, какого цвета на мне повязка. Она ...\"\nКакого цвета была его повязка, и как он догадался?",
    "solution": "Стоящий спереди (тот, который не мог видеть головные повязки стоящих за ним товарищей) размышлял следующим образом: стоящий последним молчит, что означает, что он затрудняется дать ответ – следовательно, он видит как минимум одну повязку белого цвета. Тот, что стоит посередине, тоже молчит, прекрасно понимая то, что видит перед собой последний (судя по молчанию последнего). \"Если бы на моей голове была красная повязка, то тот, кто стоит позади меня, точно бы знал, что на его голове белая повязка. Но все молчат. А следовательно, у меня на голове не красная повязка, а белая.\""
  },
  {
    "title": "Рождественская ёлка",
    "condition": "На ёлке среди других игрушек висят четыре ангелочка A, B, C и D с нимбом над головой. Ангелочки знают, что два из них имеют золотой нимб и два – голубой. Каждый из них может видеть только то, что находится внизу, и не видит даже свой собственный нимб. А сидит на самом верху, под ним висит В, ниже С, а D в самом низу скрыт ото всех других густыми ветвями ёлки так, что другие ангелочки его даже не видят.\nКто из ангелочков может первым угадать и произнести во всеуслышание цвет своего нимба?",
    "solution": "Есть два варианта решения этой задачки.\n1. Если у ангелочков В и С нимб одинакового цвета, тогда ангелочек А сразу же догадался бы о том, какого цвета у него нимб (отличный от того, который у этих двух ангелочков).\n2. Если у ангелочков В и С нимб разного цвета, тогда ангелочек А был бы озадачен и не смог бы сразу дать ответ, а его замешательство послужит сигналом для ангелочка В, который сразу догадается, какого цвета его нимб, посмотрев на ангелочка С (отличный от того, который у ангелочка С)."
  }
]
